---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RoomTag.RoomTagType
source: html/802513dd-f668-fa9f-007c-e18a7f34b321.htm
---
# Autodesk.Revit.DB.Architecture.RoomTag.RoomTagType Property

The tag type.

## Syntax (C#)
```csharp
public RoomTagType RoomTagType { get; set; }
```